narmesk/testjules1/PIC18FREMOTE/glcd.c
#include <xc.h>
#include <string.h>
#include "mcc_generated_files/system/pins.h"

unsigned char screen_x = 0, screen_y = 0;
unsigned char tx = 0, ty = 0;

#ifndef _XTAL_FREQ
#define _XTAL_FREQ 44236800UL
#endif

#ifndef FONT_WIDTH_TABLE
#define FONT_WIDTH_TABLE 0
#endif

// AIP31108 / KS0108 GLCD Komut Sabitleri
#define DISPLAY_ON_CMD         0x3F
#define DISPLAY_OFF_CMD        0x3E
#define DISPLAY_SET_Y_CMD      0x40  // Sütun Adresi (0-63)
#define DISPLAY_SET_X_CMD      0xB8  // Sayfa/Page Adresi (0-7)
#define DISPLAY_START_LINE_CMD 0xC0 // Başlangıç Satırı (0-63)

#define BLACK 1
#define WHITE 0

// Dışarıdan tanımlı font dizileri
extern const unsigned char font5x7[];
extern const unsigned char Arial_bold_14[];
extern const unsigned short Arial_bold_14_index[];
extern const unsigned char Calibri36[];
extern const unsigned short Calibri36_index[];
extern const unsigned char cp437font8x8[];
extern const unsigned char lcdnumsmin[];
extern const unsigned char lcdnumsmax[];

struct {
    unsigned char x;
    unsigned char y;
} Coord;

// Prototipler
void GLCD_Chip_Select_Direct(unsigned char Chip_idx);
void GLCD_Command_Direct(unsigned char command);
void GLCD_Data_Direct(unsigned char data);
unsigned char GLCD_ReadData_Direct(unsigned char x, unsigned char page);
void GLCD_Init(void);
void GLCD_ClearAll(void);
void GLCD_GoTo_Direct(unsigned char x, unsigned char page);

void GLCD_Command(char Command);
void GLCD_Data(char Data);
void GLCD_Chip_Select(char Chip_idx);
void GLCD_GoTo(unsigned char x, unsigned char y);
void GLCD_WriteData(unsigned char dataToWrite);

void GLCD_SetPixel(unsigned char x, unsigned char y, unsigned char color);
void GLCD_Rectangle(unsigned char x, unsigned char y, unsigned char b, unsigned char a, unsigned char color);
void GLCD_Rectangle_Fill(unsigned char x, unsigned char y, unsigned char b, unsigned char a, unsigned char color);
void SetPixels(unsigned char x, unsigned char y, unsigned char x2, unsigned char y2, unsigned char color);
void GLCD_Line(unsigned char X1, unsigned char Y1, unsigned char X2, unsigned char Y2, unsigned char color);
void GLCD_Circle(unsigned char cx, unsigned char cy, unsigned char radius, unsigned char color);
void GLCD_Circle_Fill(unsigned char cx, unsigned char cy, unsigned char radius, unsigned char color);

void GLCD_String5x7(unsigned char x, unsigned char y, char *str);
void GLCD_StringArialBold14(unsigned char x, unsigned char y, char *str);
void GLCDPutChar_ArialBold14(unsigned char c);
void GLCD_Picture(char *str);
void GLCDWriteData(unsigned char data);
void GotoXY(unsigned char x, unsigned char y);
void GLCD_StringCalibri36(unsigned char x, unsigned char y, char *str);
void GLCDPutCharCalibri36(unsigned char c);
void GLCD_StringHead8x8(unsigned char x, unsigned char y, char *str);
void GLCDPutCharHead8x8(unsigned char c);
void GLCDPutCharDigMin(unsigned char c);
void GLCDPutSpecialCharDigMin(unsigned char c);
void GLCDPutSpecialCharDigMax(unsigned char c);
void GLCDPutCharDigMax(unsigned char c);
void GLCDPutCharDigMaxFirst(unsigned char c);
void GLCDPutCharDigMaxSecond(unsigned char c);
void GLCDPutChar5x7(unsigned char c);

// Dışarıdan bildirilen okuma/durum fonksiyonu
extern unsigned char GLCD_ReadStatus(unsigned char chip);

//-------------------------------------------------------------------------------------------------
// MCC Pin Makroları İle Donanım Çip Seçim Fonksiyonu (LMC19264A-01: 3 x 64x64 = 192x64)
// Active LOW Chip Select Yapısı
//-------------------------------------------------------------------------------------------------
void GLCD_Chip_Select_Direct(unsigned char Chip_idx)
{
    if (Chip_idx == 0) // Hiçbirini seçme (All Deselected)
    {
        CS1_SetHigh();
        CS2_SetHigh();
        CS3_SetHigh();
    }
    else if (Chip_idx == 1) // Sol 64 piksel (X: 0..63) -> CS1
    {
        CS1_SetLow();
        CS2_SetHigh();
        CS3_SetHigh();
    }
    else if (Chip_idx == 2) // Orta 64 piksel (X: 64..127) -> CS2
    {
        CS1_SetHigh();
        CS2_SetLow();
        CS3_SetHigh();
    }
    else if (Chip_idx == 3) // Sağ 64 piksel (X: 128..191) -> CS3
    {
        CS1_SetHigh();
        CS2_SetHigh();
        CS3_SetLow();
    }
    else if (Chip_idx == 4) // Hepsini seç (All Selected - Init & Clear için)
    {
        CS1_SetLow();
        CS2_SetLow();
        CS3_SetLow();
    }
    __delay_us(5);
}

void GLCD_Chip_Select(char Chip_idx)
{
    GLCD_Chip_Select_Direct((unsigned char)Chip_idx);
}

//-------------------------------------------------------------------------------------------------
// MCC Pin Makroları İle Doğrudan Donanıma Komut Gönderme
//-------------------------------------------------------------------------------------------------
void GLCD_Command_Direct(unsigned char command)
{
    TRISD = 0x00;       // PORTD Çıkış
    RW_SetLow();        // RW = 0 (Yazma Modu)
    BUFDIR_SetHigh();   // BUFDIR = 1 (MCU -> LCD)
    BUFEN_SetLow();     // BUFEN = 0 (Tampon Etkin)
    BUFE2_SetLow();     // BUFE2 = 0 (Ek Tampon Etkin)
    __delay_us(2);

    LATD = command;     // Komut Byte'ını Data Bus'a Koy
    RS_SetLow();        // RS = 0 (Komut Modu)
    __delay_us(2);

    EN_SetHigh();       // EN = 1 (Enable Strobe YÜKSEK)
    __delay_us(5);
    EN_SetLow();        // EN = 0 (Enable Strobe DÜŞÜK - Düşen Kenarda İşlenir)
    __delay_us(5);

    BUFEN_SetHigh();    // BUFEN Deaktif
    BUFE2_SetHigh();    // BUFE2 Deaktif
    __delay_us(2);
}

void GLCD_Command(char Command)
{
    GLCD_Command_Direct((unsigned char)Command);
}

//-------------------------------------------------------------------------------------------------
// MCC Pin Makroları İle Doğrudan Donanıma Veri Gönderme
//-------------------------------------------------------------------------------------------------
void GLCD_Data_Direct(unsigned char data)
{
    TRISD = 0x00;       // PORTD Çıkış
    RW_SetLow();        // RW = 0 (Yazma Modu)
    BUFDIR_SetHigh();   // BUFDIR = 1 (MCU -> LCD)
    BUFEN_SetLow();     // BUFEN = 0 (Tampon Etkin)
    BUFE2_SetLow();     // BUFE2 = 0 (Ek Tampon Etkin)
    __delay_us(2);

