narmesk/testjules1/PIC18FREMOTE/glcd.c
    LATD = data;        // Veri Byte'ını Data Bus'a Koy
    RS_SetHigh();       // RS = 1 (Veri Modu)
    __delay_us(2);

    EN_SetHigh();       // EN = 1 (Enable Strobe YÜKSEK)
    __delay_us(5);
    EN_SetLow();        // EN = 0 (Enable Strobe DÜŞÜK - Düşen Kenarda Yazılır)
    __delay_us(5);

    BUFEN_SetHigh();    // BUFEN Deaktif
    BUFE2_SetHigh();    // BUFE2 Deaktif
    __delay_us(2);
}

//-------------------------------------------------------------------------------------------------
// MCC Pin Makroları İle Doğrudan Donanımdan Veri Okuma (Read-Modify-Write İçin)
//-------------------------------------------------------------------------------------------------
unsigned char GLCD_ReadData_Direct(unsigned char x, unsigned char page)
{
    unsigned char dummy, data;
    GLCD_GoTo_Direct(x, page);

    ANSELD = 0x00;      // PORTD Dijital Giriş Modu
    TRISD = 0xFF;       // PORTD Giriş Modu
    RW_SetHigh();       // RW = 1 (Okuma Modu)
    RS_SetHigh();       // RS = 1 (Veri Modu)
    BUFDIR_SetLow();    // BUFDIR = 0 (LCD -> MCU Yönü)
    BUFEN_SetLow();     // BUFEN Etkin
    BUFE2_SetLow();     // BUFE2 Etkin
    __delay_us(2);

    // KS0108 / AIP31108 Kukla Okuma (Dummy Read - RAM Adres Mandallama)
    EN_SetHigh();
    __delay_us(5);
    dummy = PORTD;
    EN_SetLow();
    __delay_us(5);

    // Gerçek Veri Okuma
    EN_SetHigh();
    __delay_us(5);
    data = PORTD;
    EN_SetLow();
    __delay_us(5);

    BUFEN_SetHigh();    // BUFEN Deaktif
    BUFE2_SetHigh();    // BUFE2 Deaktif
    RW_SetLow();        // RW Yazma Moduna İndir
    RS_SetLow();        // RS Komut Moduna İndir
    TRISD = 0x00;       // PORTD Çıkış Moduna Geri Döndür

    return data;
}

void GLCD_Data(char Data)
{
    GLCD_Data_Direct((unsigned char)Data);
}

//-------------------------------------------------------------------------------------------------
// GLCD Başlatma Fonksiyonu
//-------------------------------------------------------------------------------------------------
void GLCD_Init(void)
{
    ANSELD = 0x00;              // PORTD Dijital Mod
    TRISD = 0x00;               // Data Bus Çıkış
    BUFE2_SetHigh();            // BUFE2 Deaktif

    GLCD_Chip_Select_Direct(4); // Tüm Çipleri Seç
    __delay_ms(20);

    GLCD_Command_Direct(DISPLAY_OFF_CMD);           // Ekran Kapalı (0x3E)
    GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);     // Column = 0
    GLCD_Command_Direct(DISPLAY_SET_X_CMD | 0);     // Page = 0
    GLCD_Command_Direct(DISPLAY_START_LINE_CMD | 0);// Start Line = 0
    GLCD_Command_Direct(DISPLAY_ON_CMD);            // Ekran Açık (0x3F)

    GLCD_Chip_Select_Direct(0); // Seçimleri Kaldır
    __delay_ms(5);
}

//-------------------------------------------------------------------------------------------------
// GLCD Tüm Ekranı Temizleme (Clear Screen)
//-------------------------------------------------------------------------------------------------
void GLCD_ClearAll(void)
{
    unsigned char page, col;

    GLCD_Chip_Select_Direct(4); // Tüm Çiplere Birlikte Gönder
    for (page = 0; page < 8; page++)
    {
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | page); // Page 0..7
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD | 0);    // Column 0
        for (col = 0; col < 64; col++)
        {
            GLCD_Data_Direct(0x00); // Ekranı Temizle
        }
    }
    GLCD_Command_Direct(DISPLAY_SET_Y_CMD);
    GLCD_Command_Direct(DISPLAY_SET_X_CMD);
    GLCD_Chip_Select_Direct(0);
}

//-------------------------------------------------------------------------------------------------
// GLCD Doğrudan Konumlandırma (x: 0..191 piksel, page: 0..7 sayfa adresi)
//-------------------------------------------------------------------------------------------------
void GLCD_GoTo_Direct(unsigned char x, unsigned char page)
{
    unsigned char chip;
    unsigned char column;

    if (x >= 192 || page >= 8) return;

    chip = (x / 64) + 1; // 1: Sol (0..63), 2: Orta (64..127), 3: Sağ (128..191) Çip
    column = x % 64;     // Çip içi sütun adresi (0..63)

    GLCD_Chip_Select_Direct(chip);
    GLCD_Command_Direct(DISPLAY_SET_X_CMD | page);   // Page (0xB8 + page)
    GLCD_Command_Direct(DISPLAY_SET_Y_CMD | column); // Sütun (0x40 + column)
}

void GLCD_GoTo(unsigned char x, unsigned char y)
{
    screen_x = x;
    screen_y = y;
    GLCD_GoTo_Direct(x, (y >= 8) ? (y / 8) : y);
}

void GLCD_WriteData(unsigned char dataToWrite)
{
    GLCD_GoTo_Direct(screen_x, screen_y / 8);
    GLCD_Data_Direct(dataToWrite);
    screen_x++;
}

void GLCDWriteData(unsigned char data)
{
    GLCD_GoTo_Direct(Coord.x, Coord.y / 8);
    GLCD_Data_Direct(data);
    Coord.x++;
}

void GotoXY(unsigned char x, unsigned char y)
{
    Coord.x = x;
    Coord.y = y;
}

//-------------------------------------------------------------------------------------------------
// Doğrudan Donanım Üzerinde Çalışan Grafik Çizim Fonksiyonları (Sanal RAM Kullanmaz)
//-------------------------------------------------------------------------------------------------

// Tek Piksel Çizimi / Silimi (Doğrudan Donanıma Read-Modify-Write)
void GLCD_SetPixel(unsigned char x, unsigned char y, unsigned char color)
{
    unsigned char current_data;
    unsigned char page = y / 8;
    unsigned char bit_pos = y % 8;

    if (x >= 192 || y >= 64) return;

    current_data = GLCD_ReadData_Direct(x, page);

    if (color == BLACK)
    {
        current_data |= (1 << bit_pos);
    }
    else
    {
        current_data &= ~(1 << bit_pos);
    }

    GLCD_GoTo_Direct(x, page);
    GLCD_Data_Direct(current_data);
    GLCD_Chip_Select_Direct(0);
}

// Doğrudan Donanım Çerçeve Dikdörtgen Çizimi
void GLCD_Rectangle(unsigned char x, unsigned char y, unsigned char b, unsigned char a, unsigned char color)
{
    unsigned char j;
    for (j = x; j <= b; j++)
    {
        GLCD_SetPixel(j, y, color);
        GLCD_SetPixel(j, a, color);
    }
    for (j = y; j <= a; j++)
    {
        GLCD_SetPixel(x, j, color);
        GLCD_SetPixel(b, j, color);
    }
}

// Doğrudan Donanım Dolu Dikdörtgen Çizimi
void GLCD_Rectangle_Fill(unsigned char x, unsigned char y, unsigned char b, unsigned char a, unsigned char color)
{
    unsigned char curr_x, curr_y;
    for (curr_x = x; curr_x <= b; curr_x++)
    {
        for (curr_y = y; curr_y <= a; curr_y++)
        {
            GLCD_SetPixel(curr_x, curr_y, color);
        }
    }
}

// Alan Doldurma (Doğrudan Donanım)
void SetPixels(unsigned char x, unsigned char y, unsigned char x2, unsigned char y2, unsigned char color)
{
    GLCD_Rectangle_Fill(x, y, x2, y2, color);
}

