narmesk/testjules1/PIC18FREMOTE/glcd.c
// Doğrudan Donanım Çizgi Çizimi
void GLCD_Line(unsigned char X1, unsigned char Y1, unsigned char X2, unsigned char Y2, unsigned char color)
{
    int CurrentX, CurrentY, Xinc, Yinc,
            Dx, Dy, TwoDx, TwoDy,
            TwoDxAccumulatedError, TwoDyAccumulatedError;

    Dx = (X2 - X1);
    Dy = (Y2 - Y1);

    TwoDx = Dx + Dx;
    TwoDy = Dy + Dy;

    CurrentX = X1;
    CurrentY = Y1;

    Xinc = 1;
    Yinc = 1;

    if (Dx < 0)
    {
        Xinc = -1;
        Dx = -Dx;
        TwoDx = -TwoDx;
    }

    if (Dy < 0)
    {
        Yinc = -1;
        Dy = -Dy;
        TwoDy = -TwoDy;
    }

    GLCD_SetPixel(X1, Y1, color);

    if ((Dx != 0) || (Dy != 0))
    {
        if (Dy <= Dx)
        {
            TwoDxAccumulatedError = 0;
            do
            {
                CurrentX += Xinc;
                TwoDxAccumulatedError += TwoDy;
                if (TwoDxAccumulatedError > Dx)
                {
                    CurrentY += Yinc;
                    TwoDxAccumulatedError -= TwoDx;
                }
                GLCD_SetPixel(CurrentX, CurrentY, color);
            }
            while (CurrentX != X2);
        }
        else
        {
            TwoDyAccumulatedError = 0;
            do
            {
                CurrentY += Yinc;
                TwoDyAccumulatedError += TwoDx;
                if (TwoDyAccumulatedError > Dy)
                {
                    CurrentX += Xinc;
                    TwoDyAccumulatedError -= TwoDy;
                }
                GLCD_SetPixel(CurrentX, CurrentY, color);
            }
            while (CurrentY != Y2);
        }
    }
}

// Doğrudan Donanım Çember Çizimi
void GLCD_Circle(unsigned char cx, unsigned char cy, unsigned char radius, unsigned char color)
{
    int x, y, xchange, ychange, radiusError;
    x = radius;
    y = 0;
    xchange = 1 - 2 * radius;
    ychange = 1;
    radiusError = 0;
    while (x >= y)
    {
        GLCD_SetPixel(cx + x, cy + y, color);
        GLCD_SetPixel(cx - x, cy + y, color);
        GLCD_SetPixel(cx - x, cy - y, color);
        GLCD_SetPixel(cx + x, cy - y, color);
        GLCD_SetPixel(cx + y, cy + x, color);
        GLCD_SetPixel(cx - y, cy + x, color);
        GLCD_SetPixel(cx - y, cy - x, color);
        GLCD_SetPixel(cx + y, cy - x, color);
        y++;
        radiusError += ychange;
        ychange += 2;
        if (2 * radiusError + xchange > 0)
        {
            x--;
            radiusError += xchange;
            xchange += 2;
        }
    }
}

// Doğrudan Donanım Dolu Çember Çizimi
void GLCD_Circle_Fill(unsigned char cx, unsigned char cy, unsigned char radius, unsigned char color)
{
    unsigned char temp = radius;
    while (temp > 0)
    {
        GLCD_Circle(cx, cy, temp, color);
        temp--;
    }
}

//-------------------------------------------------------------------------------------------------
// Metin ve Font Fonksiyonları (Doğrudan Donanıma Yazma)
//-------------------------------------------------------------------------------------------------
void GLCD_String5x7(unsigned char x, unsigned char y, char *str)
{
    unsigned char i = 0;
    unsigned char curr_x = x;
    unsigned char page = (y >= 8) ? (y / 8) : y;

    while (str[i] != '\0')
    {
        if (curr_x + 6 > 192) break; // Ekran genişlik sınırını aşma

        unsigned char c = str[i];
        if (c < 0x20 || c > 0x7E) c = ' ';
        unsigned short font_idx = (c - 0x20) * 5;

        for (unsigned char k = 0; k < 5; k++)
        {
            GLCD_GoTo_Direct(curr_x, page);
            GLCD_Data_Direct(font5x7[font_idx + k]);
            curr_x++;
        }

        GLCD_GoTo_Direct(curr_x, page);
        GLCD_Data_Direct(0x00);
        curr_x++;

        i++;
    }
    GLCD_Chip_Select_Direct(0);
}

void GLCDPutChar5x7(unsigned char c)
{
    c -= 0x20;
    unsigned short index = c * 5;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(font5x7[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y += 8;
    tx = tx + 6;
}

void GLCD_StringArialBold14(unsigned char x, unsigned char y, char *str)
{
    tx = x;
    ty = y;
    unsigned char i;
    for (i = 0; i < strlen(str); i++)
    {
        GLCDPutChar_ArialBold14(str[i]);
    }
}

void GLCDPutChar_ArialBold14(unsigned char c)
{
    unsigned char width;
    unsigned short index;
    unsigned char data;
    unsigned short j;
    unsigned short jj;
    unsigned short page;
    c -= 0x20;
    if (c != 0)
    {
        index = ((Arial_bold_14_index[c - 1]) * 2) + 0x60 + FONT_WIDTH_TABLE;
    }
    else
    {
        index = 0x60 + FONT_WIDTH_TABLE;
    }
    width = Arial_bold_14[FONT_WIDTH_TABLE + c];
    Coord.x = tx;
    Coord.y = ty;
    jj = index + width;
    for (j = index; j < jj; j++)
    {
        data = Arial_bold_14[j];
        GLCDWriteData(data);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y += 8;
    page = width + index;
    jj += width;
    for (j = page; j < jj; j++)
    {
        data = Arial_bold_14[j];
        data >>= 2;
        GLCDWriteData(data);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y += 8;
    tx = tx + width + 1;
}

void GLCD_StringCalibri36(unsigned char x, unsigned char y, char *str)
{
    tx = x;
    ty = y;
    unsigned char i;
    for (i = 0; i < strlen(str); i++)
    {
        GLCDPutCharCalibri36(str[i]);
    }
}

void GLCDPutCharCalibri36(unsigned char c)
{
    unsigned char width = 0;
    unsigned short index;
    unsigned short page;
    unsigned char data;
    unsigned short j;
    unsigned short jj;
    c -= 0x20;
    if (c != 0)
    {
        index = Calibri36_index[c - 1] + 0x7 + FONT_WIDTH_TABLE;
    }
    else
    {
        index = 0x7 + FONT_WIDTH_TABLE;
    }
    width = Calibri36[FONT_WIDTH_TABLE + c];
    Coord.x = tx;
    Coord.y = ty;
    page = index;
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        GLCDWriteData(Calibri36[j]);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    page = index + width;
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        GLCDWriteData(Calibri36[j]);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;

    page = index + (2 * width);
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        GLCDWriteData(Calibri36[j]);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;

    page = index + (3 * width);
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        GLCDWriteData(Calibri36[j]);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;

    page = index + 4 * width;
    jj = page + width;
    for (j = page; j < jj; j++)
    {
        data = Calibri36[j];
        data >>= 4;
        GLCDWriteData(data);
    }
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + width + 1;
}

void GLCD_StringHead8x8(unsigned char x, unsigned char y, char *str)
{
    tx = x;
    ty = y;
    unsigned char i;
    for (i = 0; i < strlen(str); i++)
    {
        GLCDPutCharHead8x8(str[i]);
    }
}

