narmesk/testjules1/PIC18FREMOTE/glcd.c
void GLCDPutCharHead8x8(unsigned char c)
{
    unsigned short index;
    index = (c * 8) + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(cp437font8x8[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 9;
}

void GLCDPutCharDigMin(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (22 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 12;
}

void GLCDPutSpecialCharDigMin(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (22 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx - 1;
    Coord.y = ty;
    index++;
    index++;
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    GLCDWriteData(lcdnumsmin[index++]);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx - 1;
    Coord.y = Coord.y + 8;
    index++;
    index++;
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmin[index++];
    data >>= 1;
    GLCDWriteData(data);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 5;
}

void GLCDPutSpecialCharDigMax(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (39 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    index++;
    index++;
    index++;
    index++;
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    index++;
    index++;
    index++;
    index++;
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 5;
}

void GLCDPutCharDigMax(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (39 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 14;
}

void GLCDPutCharDigMaxFirst(unsigned char c)
{
    unsigned short index;
    c -= '+';
    index = (39 * c) + 16 + FONT_WIDTH_TABLE;
    Coord.x = tx;
    Coord.y = ty;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(lcdnumsmax[index++]);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
}

