narmesk/testjules1/PIC18FREMOTE/glcd.c
void GLCDPutCharDigMaxSecond(unsigned char c)
{
    unsigned short index;
    unsigned char data;
    c -= '+';
    index = (39 * c) + 42 + FONT_WIDTH_TABLE;
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    data = lcdnumsmax[index++];
    data >>= 1;
    GLCDWriteData(data);
    GLCDWriteData(0x00);
    Coord.x = tx;
    Coord.y = Coord.y + 8;
    tx = tx + 14;
}

// Resim basma fonksiyonları
void GLCD_Picture(char *str)
{
    unsigned char i, j;
    for (i = 0; i < 8; ++i)
    {
        GLCD_Chip_Select_Direct(1);
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD);
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | i);
        GLCD_Chip_Select_Direct(2);
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD);
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | i);
        GLCD_Chip_Select_Direct(3);
        GLCD_Command_Direct(DISPLAY_SET_Y_CMD);
        GLCD_Command_Direct(DISPLAY_SET_X_CMD | i);
        for (j = 0; j < 64; ++j)
        {
            GLCD_Chip_Select_Direct(1);
            GLCD_Data_Direct(str[(i * 192) + j]);
            GLCD_Chip_Select_Direct(2);
            GLCD_Data_Direct(str[(i * 192) + j + 64]);
            GLCD_Chip_Select_Direct(3);
            GLCD_Data_Direct(str[(i * 192) + j + 128]);
        }
    }
    GLCD_Chip_Select_Direct(0);
}
